## Kütüphanelerin eklenmesi

In [16]:
import numpy as np
import pandas as pd

## Veri setinin okunması

In [30]:
users = pd.read_csv("C:\\Users\\Begum\\Desktop\\IMDB\\users.data", sep="\t", names=["user_id", "item_id", "rating", "timestamp"])

In [31]:
users.head()

   user_id  item_id  rating  timestamp
0        0       50       5  881250949
1        0      172       5  881250949
2        0      133       1  881250949
3      196      242       3  881250949
4      186      302       3  891717742

# Kullanıcı sayısının hesaplanması

In [32]:
len(users)

100003

In [33]:
movies = pd.read_csv("C:\\Users\\Begum\\Desktop\\IMDB\\movie_id_titles.csv")

In [34]:
movies.head()

   item_id              title
0        1   Toy Story (1995)
1        2   GoldenEye (1995)
2        3  Four Rooms (1995)
3        4  Get Shorty (1995)
4        5     Copycat (1995)

# Film sayısının hesaplanması

In [35]:
len(movies)

1682

# Tabloların birleştirilmesi (merge)

users ve movies tablolarını ortak sütun olan iten_id üzerinden birleştiriyoruz. Daha sonra yeni oluşturulan data değişkenine yeni tabloyu kaydediyoruz.
Bu işlem SQL de bulunan join işlemidir.

In [ ]:
data = pd.merge(users, movies, on = "item_id")

In [40]:
data.tail()

        user_id  item_id  rating  timestamp                         title
99998       880      476       3  880175444  First Wives Club, The (1996)
99999       716      204       5  879795543     Back to the Future (1985)
100000      276     1090       1  874795795                 Sliver (1993)
100001       13      225       2  882399156         101 Dalmatians (1996)
100002       12      203       3  879959583             Unforgiven (1992)

In [41]:
table = data.pivot_table(index = "user_id", columns = "title", values = "rating")
table.head()

title,'Til There Was You (1997),1-900 (1994),101 Dalmatians (1996),12 Angry Men (1957),187 (1997),2 Days in the Valley (1996),"20,000 Leagues Under the Sea (1954)",2001: A Space Odyssey (1968),3 Ninjas: High Noon At Mega Mountain (1998),"39 Steps, The (1935)",...,Yankee Zulu (1994),Year of the Horse (1997),You So Crazy (1994),Young Frankenstein (1974),Young Guns (1988),Young Guns II (1990),"Young Poisoner's Handbook, The (1995)",Zeus and Roxanne (1997),unknown,Á köldum klaka (Cold Fever) (1994)
user_id,,,,,,,,,,,,,,,,,,,,,
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,2.0,5.0,NaN,NaN,3.0,4.0,NaN,NaN,...,NaN,NaN,NaN,5.0,3.0,NaN,NaN,NaN,4.0,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Bu satır, elimizdeki veriyi kullanıcıları satırlara, filmleri sütunlara, rating değerlerini de hücrelere yerleştirerek bir pivot tablo oluşturuyor.

In [42]:
starwars = table ["Star Wars (1977)"]
starwars.head()

user_id
0    5.0
1    5.0
2    5.0
3    NaN
4    5.0
Name: Star Wars (1977), dtype: float64

Burada yapılan işlem, Star Wars (1977) filmi için tüm kullanıcıların verdiği puanları içeren bir seriyi (Series) tablodan çekmek.

In [43]:
type(starwars)

pandas.core.series.Series

In [ ]:
correlation = table.corrwith(starwars)